app/Controllers/Genero.php

SELECT *
FROM `genero`
---
    public function getIndex(): string
    {
        $genero = model(GeneroModel::class);
        $data['genero']=$genero->findAll();