app/Models/GeneroModel.php

    public function insertar($datos)
    {
        $Nombres = $this->db->table('genero');
        $Nombres->insert($datos);
---
INSERT INTO `genero` (`nombre`, `descripcion`) VALUES ('Romance', 'abrazos')

    public function obtenerGeneros() {
        $generoModel = model(GeneroModel::class);
        return $generoModel->findAll();
---
SELECT *
FROM `genero`