app/Models/PeliculasModel.php

    public function BuscarTodos(){
        $db = db_connect();

        $builder = $db->table($this->table);
        $builder->select('pelicula.id, pelicula.nombre as name, genero.nombre, pelicula.puntuacion, pelicula.anio, popularidad.nombre as namePopu');
        $builder->join('genero', 'genero.id=pelicula.id_genero');
        $builder->join('popularidad', 'popularidad.id=pelicula.id_popularidad');
        $query = $builder->get();
---
SELECT `pelicula`.`id`, `pelicula`.`nombre` as `name`, `genero`.`nombre`, `pelicula`.`puntuacion`, `pelicula`.`anio`, `popularidad`.`nombre` as `namePopu`
FROM `pelicula`
JOIN `genero` ON `genero`.`id`=`pelicula`.`id_genero`
JOIN `popularidad` ON `popularidad`.`id`=`pelicula`.`id_popularidad`

    public function insertar($datos)
    {
        $Nombres = $this->db->table('pelicula');
        $Nombres->insert($datos);
---
INSERT INTO `pelicula` (`nombre`, `id_genero`, `puntuacion`, `anio`, `id_popularidad`) VALUES ('Barbie', '7', '90', '2023', '2')