app/Models/PopularidadModel.php

    public function BuscarTodos(){
        $db = db_connect();

        $builder = $db->table($this->table);
        $builder->select('popularidad.id, popularidad.nombre as namePopu');

        $query = $builder->get();
---
SELECT `popularidad`.`id`, `popularidad`.`nombre` as `namePopu`
FROM `popularidad`

    public function obtenerPopularidad() {
        $popularidadModel = model(PopularidadModel::class);
        return $popularidadModel->findAll();
---
SELECT *
FROM `popularidad`